import { colorize, palette, text } from "@vlandoss/clibuddy";

const vlandColor = colorize("#a78bfa");

// npx figlet -f "ANSI Shadow" "vland"
export function getBannerText(version: string) {
  const uiLogo = vlandColor(
    `
██╗   ██╗██╗      █████╗ ███╗   ██╗██████╗
██║   ██║██║     ██╔══██╗████╗  ██║██╔══██╗
██║   ██║██║     ███████║██╔██╗ ██║██║  ██║
╚██╗ ██╔╝██║     ██╔══██║██║╚██╗██║██║  ██║
 ╚████╔╝ ███████╗██║  ██║██║ ╚████║██████╔╝
  ╚═══╝  ╚══════╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═════╝ ${text.version(version)}
`.trim(),
  );

  return `
${uiLogo}

🦉 ${palette.italic(palette.muted("The CLI to init a new project in"))} ${text.vland}\n`.trimStart();
}
